Repository: Taedj/dentaltid
Catalog: lib/l10n/app_*.arb
Languages: ar

source: Good Evening
ar: مساء الخير

source: Scheduled Visits
ar: الزيارات المجدولة

source: Action Needed
ar: إجراء مطلوب

source: All Good
ar: كل شيء جيد

# activeStatus
source: Active: {count}
ar: نشط: {count}

# doneStatus
source: Done: {count}
ar: تم: {count}

# clinicRunningSmoothly
source: Clinic running smoothly today ðŸ¦·
ar: العيادة تعمل بسلاسة اليوم 🦷

# expiringLabel
source: {count} Expiring
ar: {count} تنتهي صلاحيتها

# lowStockLabelText
source: {count} Low Stock
ar: {count} مخزون منخفض

# staffActivationNotice
source: The main dentist user must activate premium to continue using the application.
ar: يجب على طبيب الأسنان الرئيسي تفعيل العضوية المميزة للاستمرار في استخدام التطبيق.

# overviewMenu
source: Overview
ar: نظرة عامة

# usersMenu
source: Users
ar: المستخدمين

# codesMenu
source: Codes
ar: الأكواد

# broadcastsMenu
source: Broadcasts
ar: البث

# serverOnlineNoStaff
source: Server Online (No staff connected)
ar: الخادم متصل (لا يوجد موظفين متصلين)

# serverOnlineWithStaffCount
source: Server Online ({count} staff connected)
ar: الخادم متصل ({count} موظفين متصلين)

# staffConnectedList
source: Connected: {names}
ar: المتصلون: {names}

source: Connected to Server
ar: متصل بالخادم

source: Offline
ar: غير متصل

# invalidCodeLength
source: Invalid code length (must be 27 characters)
ar: طول الكود غير صحيح (يجب أن يكون 27 حرفاً)

# activationSuccess
source: Account Activated Successfully! Premium features are now enabled.
ar: تم تفعيل الحساب بنجاح! الميزات المميزة مفعلة الآن.

# invalidActivationCode
source: Invalid or expired activation code
ar: كود التفعيل غير صحيح أو منتهي الصلاحية

# activationError
source: Error during activation: {error}
ar: خطأ أثناء التفعيل: {error}

source: Activation Required
ar: التفعيل مطلوب

# trialExpiredNotice
source: Your trial period has expired. Please enter a valid activation code to continue using DentalTid Premium.
ar: انتهت الفترة التجريبية الخاصة بك. يرجى إدخال كود تفعيل صالح للاستمرار في استخدام DentalTid Premium.

# activationCodeLabel
source: Activation Code (27 chars)
ar: كود التفعيل (27 حرفاً)

source: Need a code?
ar: هل تحتاج إلى كود؟

source: Edit Doctor Profile
ar: تعديل الملف الشخصي للطبيب

source: Update Your Profile
ar: تحديث ملفك الشخصي

source: Save Changes
ar: حفظ التغييرات

# enterYourName
source: Please enter your name
ar: يرجى إدخال اسمك

# profileUpdatedSuccess
source: Profile updated successfully!
ar: تم تحديث الملف الشخصي بنجاح!

# profileUpdateError
source: Failed to save profile: {error}
ar: فشل في حفظ الملف الشخصي: {error}

# loginToSaveProfileError
source: Could not save profile. User not logged in.
ar: تعذر حفظ الملف الشخصي. المستخدم غير مسجل الدخول.

source: Required
ar: مطلوب

source: Must be 4 digits
ar: يجب أن يكون 4 أرقام

source: Edit Staff
ar: تعديل الموظف

source: Add New Staff
ar: إضافة موظف جديد

source: Full Name
ar: الاسم الكامل

source: System Health
ar: صحة النظام

source: Developer Overview
ar: نظرة عامة للمطور

source: Total Users
ar: إجمالي المستخدمين

source: Active Trials
ar: التجارب النشطة

source: Est. Revenue
ar: الإيرادات المقدرة

# noPatientsFoundSearch
source: No patients found matching "{query}"
ar: لم يتم العثور على مرضى يطابقون "{query}"

# paidStatusLabel
source: Paid
ar: مدفوع

# searchHintSeparator
source: or Phone...
ar: أو الهاتف...

# savePatientsCsvLabel
source: Save Patients CSV
ar: حفظ ملف المرضى CSV

# localBackupConfirm
source: This backup will include your clinic database, app settings, and staff accounts. Do you want to proceed?
ar: سيشمل هذا النسخ الاحتياطي قاعدة بيانات عيادتك وإعدادات التطبيق وحسابات الموظفين. هل تريد الاستمرار؟

source: Premium Only
ar: للمشتركين فقط

# cloudSyncConfirm
source: This will upload your clinic database, settings, and staff accounts to the cloud for safe keeping. Do you want to proceed?
ar: سيؤدي هذا إلى رفع قاعدة بيانات عيادتك وإعداداتك وحسابات الموظفين إلى السحابة للحفاظ عليها. هل تريد الاستمرار؟

# cloudSyncPremiumNotice
source: Cloud Sync is a detailed Premium feature. Activate to enable.
ar: المزامنة السحابية هي ميزة متقدمة للمشتركين. قم بالتفعيل للتمكين.

source: Manage Staff Members
ar: إدارة أعضاء الفريق

# addStaffSubtitle
source: Add Assistants or Receptionists
ar: إضافة مساعدين أو موظفي استقبال

source: LAN Sync Settings
ar: إعدادات مزامنة الشبكة المحلية

# autoStartServerLabel
source: Auto-start Server
ar: تشغيل الخادم تلقائياً

# autoStartServerSubtitle
source: Start sync server on app launch
ar: بدء تشغيل خادم المزامنة عند فتح التطبيق

# serverPortLabel
source: Server Port
ar: منفذ الخادم

# defaultPortHelper
source: Default: 8080
ar: الافتراضي: 8080

# advancedNetworkConfig
source: Advanced Network Configuration
ar: تكوين الشبكة المتقدم

# advancedNetworkConfigSubtitle
source: Logs, Firewall, and IP settings
ar: السجلات، جدار الحماية، وإعدادات IP

# errorLoadingProfile
source: Error loading user profile: {error}
ar: خطأ في تحميل الملف الشخصي: {error}

# deleteTransactionConfirm
source: Are you sure you want to delete this transaction?
ar: هل أنت متأكد أنك تريد حذف هذه العملية؟

# transactionDeletedSuccess
source: Transaction deleted successfully
ar: تم حذف العملية بنجاح

source: Limit Reached
ar: تم الوصول إلى الحد الأقصى

# inventoryLimitMessage
source: You have reached the limit of 100 inventory items for the Trial version. Please upgrade to Premium to continue adding items.
ar: لقد وصلت إلى الحد الأقصى وهو 100 عنصر مخزون للنسخة التجريبية. يرجى الترقية إلى النسخة المميزة لمتابعة إضافة العناصر.

# okButton
source: OK
ar: حسناً

source: Trial Active
ar: فترة تجريبية

source: Email
ar: البريد الإلكتروني

# enterEmail
source: Please enter an email
ar: الرجاء إدخال البريد الإلكتروني

# enterValidEmail
source: Please enter a valid email
ar: الرجاء إدخال بريد إلكتروني صالح

# enterPassword
source: Please enter a password
ar: الرجاء إدخال كلمة المرور

source: Clinic Address
ar: عنوان العيادة

# enterClinicAddress
source: Please enter clinic address
ar: الرجاء إدخال عنوان العيادة

source: Province
ar: المقاطعة

# enterProvince
source: Please enter province
ar: الرجاء إدخال المقاطعة

source: Country
ar: البلد

# enterCountry
source: Please enter country
ar: الرجاء إدخال البلد

source: Supplier Contact
ar: جهة الاتصال

# enterSupplierContact
source: Enter supplier info
ar: أدخل معلومات المورد
