Repository: Taedj/dentaltid
Catalog: lib/l10n/app_*.arb
Languages: ar

source: Dashboard
ar: لوحة القيادة

source: Patients
ar: المرضى

source: Appointments
ar: المواعيد

source: Inventory
ar: المخزون

source: Finance
ar: المالية

source: Add Appointment
ar: إضافة موعد

source: Edit Appointment
ar: تعديل الموعد

source: Patient
ar: المريض

# selectPatient
source: Please select a patient
ar: الرجاء اختيار مريض

source: Date (YYYY-MM-DD)
ar: التاريخ (YYYY-MM-DD)

# enterDate
source: Please enter a date
ar: الرجاء إدخال تاريخ

# invalidDateFormat
source: Please enter a valid date in YYYY-MM-DD format
ar: الرجاء إدخال تاريخ صالح بالتنسيق YYYY-MM-DD

source: Invalid Date
ar: تاريخ غير صالح

# dateInPast
source: Date cannot be in the past
ar: لا يمكن أن يكون التاريخ في الماضي

source: Time (HH:MM)
ar: الوقت (HH:MM)

# enterTime
source: Please enter a time
ar: الرجاء إدخال وقت

# invalidTimeFormat
source: Please enter a valid time in HH:MM format
ar: الرجاء إدخال وقت صالح بالتنسيق HH:MM

source: Add
ar: إضافة

source: Update
ar: تحديث

source: Error:
ar: خطأ:

# invalidTime
source: Time must be between {start} and {end}
ar: يجب أن يكون الوقت بين {start} و {end}

# appointmentExistsError
source: An appointment for this patient at this date and time already exists.
ar: يوجد موعد لهذا المريض في هذا التاريخ والوقت بالفعل.

source: Settings
ar: الإعدادات

source: Account
ar: الحساب

source: Change Password
ar: تغيير كلمة المرور

source: Edit Profile
ar: تعديل الملف الشخصي

source: Current Password
ar: كلمة المرور الحالية

source: New Password
ar: كلمة المرور الجديدة

source: Password changed successfully
ar: تم تغيير كلمة المرور بنجاح

source: Invalid password
ar: كلمة مرور خاطئة

source: Passwords do not match
ar: كلمات المرور غير متطابقة

source: Language
ar: اللغة

source: Theme
ar: المظهر

source: Local Backup
ar: النسخ الاحتياطي المحلي

source: Backup created at
ar: تم إنشاء النسخ الاحتياطي في

source: Backup failed or cancelled
ar: فشل النسخ الاحتياطي أو تم إلغاؤه

source: Create Local Backup
ar: إنشاء نسخ احتياطي محلي

source: Backup restored successfully
ar: تم استعادة النسخ الاحتياطي بنجاح

source: Restore failed or cancelled
ar: فشل الاستعادة أو تم إلغاؤها

source: Cloud Sync
ar: المزامنة السحابية

source: Backup uploaded to cloud
ar: تم تحميل النسخ الاحتياطي إلى السحابة

source: Cloud backup failed
ar: فشل النسخ الاحتياطي السحابي

source: Sync to Cloud
ar: المزامنة مع السحابة

source: Manage Cloud Backups
ar: إدارة النسخ الاحتياطية السحابية

source: Currency
ar: العملة

source: Logout
ar: تسجيل الخروج

source: Show All Appointments
ar: عرض جميع المواعيد

source: Show Upcoming Only
ar: عرض القادمة فقط

source: Time (Earliest First)
ar: الوقت (الأبكر أولاً)

source: Time (Latest First)
ar: الوقت (الأحدث أولاً)

source: Patient ID
ar: معرف المريض

source: Search Appointments
ar: البحث في المواعيد

source: No appointments found
ar: لم يتم العثور على مواعيد

source: Delete Appointment
ar: حذف الموعد

# confirmDeleteAppointment
source: Are you sure you want to delete this appointment?
ar: هل أنت متأكد أنك تريد حذف هذا الموعد؟

source: Confirm
ar: تأكيد

source: Welcome Dr.
ar: مرحباً د.

source: Welcome
ar: مرحباً

source: Total Number of Patients
ar: إجمالي عدد المرضى

source: Emergency Patients
ar: مرضى الطوارئ

source: Upcoming Appointments
ar: المواعيد القادمة

source: Payments
ar: المدفوعات

source: Quick Actions
ar: الإجراءات السريعة

source: Emergency Alerts
ar: تنبيهات الطوارئ

source: No Emergencies
ar: لا توجد طوارئ

source: Receipt
ar: الإيصال

source: Total
ar: المجموع

source: Outstanding Amount
ar: المبلغ المستحق

source: Close
ar: إغلاق

source: Add Patient
ar: إضافة مريض

source: Edit Patient
ar: تعديل المريض

source: Family Name
ar: اسم العائلة

# enterFamilyName
source: Please enter family name
ar: الرجاء إدخال اسم العائلة

source: Age
ar: العمر

# enterAge
source: Please enter age
ar: الرجاء إدخال العمر

# enterValidNumber
source: Please enter a valid number
ar: الرجاء إدخال رقم صحيح

# enterAgeBetween
source: Please enter age between 1 and 120
ar: الرجاء إدخال عمر بين 1 و 120

source: Health State
ar: حالة الصحة

source: Diagnosis
ar: التشخيص

source: Treatment
ar: العلاج

source: Payment
ar: الدفع

# enterPaymentAmount
source: Please enter payment amount
ar: الرجاء إدخال مبلغ الدفع

source: Payment cannot be negative
ar: لا يمكن أن يكون الدفع سلبياً

source: Phone Number
ar: رقم الهاتف

# enterValidPhoneNumber
source: Please enter a valid phone number
ar: الرجاء إدخال رقم هاتف صحيح

source: Emergency Details
ar: تفاصيل الطوارئ

source: Is Emergency
ar: هل هو طوارئ

source: Severity
ar: الشدة

source: Health Alerts
ar: تنبيهات الصحة

source: Payment History
ar: تاريخ المدفوعات

source: No payment history
ar: لا يوجد تاريخ مدفوعات

source: Edit
ar: تعديل

source: Save
ar: حفظ

source: No patients yet
ar: لا يوجد مرضى بعد

source: No health alerts
ar: لا توجد تنبيهات صحية

source: Created At
ar: تم الإنشاء في

source: Emergency
ar: طوارئ

source: Number
ar: الرقم

source: Actions
ar: الإجراءات

source: Delete Patient
ar: حذف المريض

# confirmDeletePatient
source: Are you sure you want to delete this patient?
ar: هل أنت متأكد أنك تريد حذف هذا المريض؟

# todaysAppointmentsFlow
source: Today's Appointments
ar: مواعيد اليوم

source: Waiting
ar: في الانتظار

source: In Progress
ar: قيد التقدم

source: Completed
ar: مكتمل

# mustBeLoggedInToSync
source: You must be logged in to sync to the cloud.
ar: يجب عليك تسجيل الدخول للمزامنة مع السحابة.

source: Date (Newest First)
ar: التاريخ (الأحدث أولاً)

source: Date (Oldest First)
ar: التاريخ (الأقدم أولاً)

source: Start Appointment
ar: بدء الموعد

source: Complete Appointment
ar: إنهاء الموعد

source: Cancel Appointment
ar: إلغاء الموعد

# confirmCancelAppointment
source: Are you sure you want to cancel this appointment?
ar: هل أنت متأكد أنك تريد إلغاء هذا الموعد؟

source: Add Transaction
ar: إضافة معاملة

source: Financial Summary
ar: الملخص المالي

source: Description
ar: الوصف

# enterDescription
source: Please enter a description
ar: الرجاء إدخال وصف

source: Total Amount
ar: المبلغ الإجمالي

# enterTotalAmount
source: Please enter total amount
ar: الرجاء إدخال المبلغ الإجمالي

# enterValidPositiveAmount
source: Please enter a valid positive amount
ar: الرجاء إدخال مبلغ موجب صالح

source: Paid Amount
ar: المبلغ المدفوع

# enterPaidAmount
source: Please enter paid amount
ar: الرجاء إدخال المبلغ المدفوع

# enterValidNonNegativeAmount
source: Please enter a valid non-negative amount
ar: الرجاء إدخال مبلغ غير سالب صالح

source: Type
ar: النوع

source: Income
ar: الدخل

source: Expense
ar: المصروفات

source: Payment Method
ar: طريقة الدفع

source: Cash
ar: نقداً

source: Card
ar: بطاقة

source: Bank Transfer
ar: تحويل بنكي

source: Search Transactions
ar: البحث في المعاملات

source: All Types
ar: جميع الأنواع

source: Amount (Highest First)
ar: المبلغ (الأعلى أولاً)

source: Amount (Lowest First)
ar: المبلغ (الأدنى أولاً)

source: Show All Items
ar: عرض جميع العناصر

source: Show Expired Only
ar: عرض العناصر منتهية الصلاحية فقط

source: Show Low Stock Only
ar: عرض العناصر منخفضة المخزون فقط

source: Name (A-Z)
ar: الاسم (أ-ي)

source: Name (Z-A)
ar: الاسم (ي-أ)

source: Quantity (Low to High)
ar: الكمية (من الأقل للأعلى)

source: Quantity (High to Low)
ar: الكمية (من الأعلى للأقل)

source: Expiry (Soonest First)
ar: الانتهاء (الأقرب أولاً)

source: Expiry (Latest First)
ar: الانتهاء (الأبعد أولاً)

source: Search Inventory Items
ar: البحث في عناصر المخزون

source: Name
ar: الاسم

source: Quantity
ar: الكمية

source: Expiration Date
ar: تاريخ انتهاء الصلاحية

source: Supplier
ar: المورد

source: Add Item
ar: إضافة عنصر

source: No items found
ar: لم يتم العثور على عناصر

source: Expires
ar: ينتهي

source: Expired
ar: منتهي الصلاحية

source: Low Stock
ar: مخزون منخفض

source: Delete Item
ar: حذف العنصر

# deleteItemButton
source: Delete
ar: حذف

# confirmDeleteItem
source: Are you sure you want to delete this item?
ar: هل أنت متأكد أنك تريد حذف هذا العنصر؟

source: Cancel
ar: إلغاء

# enterName
source: Please enter a name
ar: الرجاء إدخال اسم

# enterQuantity
source: Please enter a quantity
ar: الرجاء إدخال كمية

# enterSupplier
source: Please enter a supplier
ar: الرجاء إدخال مورد

source: Confirm New Password
ar: تأكيد كلمة المرور الجديدة

source: Restore from Local Backup
ar: استعادة من النسخ الاحتياطي المحلي

source: Date
ar: التاريخ

source: Method
ar: الطريقة

source: Paid
ar: مدفوع

source: Unpaid
ar: غير مدفوع

source: No transactions yet
ar: لا توجد معاملات بعد

source: Visit History
ar: تاريخ الزيارات

source: No visit history
ar: لا يوجد تاريخ زيارات

source: Visit Date
ar: تاريخ الزيارة

source: Reason for Visit
ar: سبب الزيارة

source: Add Visit
ar: إضافة زيارة

source: Edit Visit
ar: تعديل الزيارة

source: Notes
ar: الملاحظات

# enterReasonForVisit
source: Please enter a reason for visit
ar: الرجاء إدخال سبب الزيارة

source: Search Patient
ar: البحث عن مريض

source: Show Current Day Patients
ar: عرض مرضى اليوم

source: Visit Details
ar: تفاصيل الزيارة

source: Create New Visit
ar: إنشاء زيارة جديدة

source: Select Existing Visit
ar: اختيار زيارة موجودة

# requiredField
source: This field is required
ar: هذا الحقل مطلوب

source: Emergency Severity
ar: شدة الطوارئ

source: Session Details
ar: تفاصيل الجلسة

source: Number of Sessions
ar: عدد الجلسات

source: Session
ar: الجلسة

source: Date & Time
ar: التاريخ والوقت

source: Treatment Details
ar: تفاصيل العلاج

source: Patient Notes
ar: ملاحظات المريض

source: Blacklist Patient
ar: مريض في القائمة السوداء

# noTransactionsFound
source: No transactions found for this period
ar: لم يتم العثور على معاملات لهذه الفترة

source: Recurring Charges
ar: رسوم متكررة

source: No recurring charges found
ar: لم يتم العثور على رسوم متكررة

source: Add Recurring Charge
ar: إضافة رسوم متكررة

source: Edit Recurring Charge
ar: تعديل الرسوم المتكررة

source: Amount
ar: المبلغ

source: Frequency
ar: التكرار

source: Start Date
ar: تاريخ البدء

source: End Date
ar: تاريخ الانتهاء

source: Is Active
ar: نشط

source: Transactions
ar: المعاملات

source: Overview
ar: نظرة عامة

source: Daily Summary
ar: ملخص يومي

source: Weekly Summary
ar: ملخص أسبوعي

source: Monthly Summary
ar: ملخص شهري

source: Yearly Summary
ar: ملخص سنوي

source: Expenses
ar: المصروفات

source: Profit
ar: الربح

source: Filters
ar: الفلاتر

source: Inventory Expenses
ar: مصاريف المخزون

source: Staff Salaries
ar: رواتب الموظفين

source: Rent
ar: الإيجار

source: Change Date
ar: تغيير التاريخ

source: Transaction added successfully
ar: تم إضافة المعاملة بنجاح

source: Invalid amount
ar: مبلغ غير صالح

# pleaseEnterAmount
source: Please enter an amount
ar: الرجاء إدخال مبلغ

source: View Details
ar: عرض التفاصيل

source: Critical Alerts
ar: تنبيهات حرجة

source: View Critical
ar: عرض الحالات الحرجة

source: View Appointments
ar: عرض المواعيد

source: Today: {count}
ar: اليوم: {count}

source: Waiting: {count}
ar: قيد الانتظار: {count}

source: In Progress: {count}
ar: جارٍ: {count}

source: Completed: {count}
ar: مكتمل: {count}

# emergencyCountLabel
source: Emergency: {count}
ar: طوارئ: {count}

source: Expiring Soon
ar: تنتهي صلاحيتها قريبًا

source: Expiring Soon: {count}
ar: تنتهي قريبًا: {count}

source: Low Stock: {count}
ar: مخزون منخفض: {count}

source: Patient Name
ar: اسم المريض

source: Item Name
ar: اسم العنصر

source: Countdown
ar: العد التنازلي

source: Current Quantity
ar: الكمية الحالية

# daysLeft
source: {days}d left
ar: متبقي {days} يوم

source: No patients today
ar: لا يوجد مرضى اليوم

source: No Expiring Soon items
ar: لا توجد عناصر تنتهي صلاحيتها قريبًا

source: No Low Stock items
ar: لا توجد عناصر منخفضة المخزون

source: No Waiting appointments
ar: لا توجد مواعيد قيد الانتظار

source: No Emergency appointments
ar: لا توجد مواعيد طوارئ

source: No Completed appointments
ar: لا توجد مواعيد مكتملة

source: Error loading emergency appointments
ar: خطأ في تحميل مواعيد الطوارئ

source: Error loading appointments
ar: خطأ في تحميل المواعيد

source: Error loading patient data
ar: خطأ في تحميل بيانات المريض

source: Error loading inventory
ar: خطأ في تحميل المخزون

# dateOfBirthLabel
source: Date of Birth
ar: تاريخ الميلاد

# selectDateOfBirthError
source: Please select date of birth
ar: يرجى اختيار تاريخ الميلاد

# invalidDateFormatError
source: Invalid date format
ar: تنسيق التاريخ غير صالح

# patientSelectionTitle
source: Patient Selection
ar: اختر المريض

# choosePatientLabel
source: Choose Patient
ar: اختر مريضاً

# selectPatientLabel
source: Select Patient
ar: تحديد المريض

# addNewPatientButton
source: Add New Patient
ar: إضافة مريض جديد

# appointmentDateTimeTitle
source: Appointment Date & Time
ar: تاريخ ووقت الموعد

# dateTimeLabel
source: Date & Time
ar: التاريخ والوقت

# selectDateTimeLabel
source: Select Date & Time
ar: اختر التاريخ والوقت

# selectDateTimeError
source: Please select date and time
ar: يرجى اختيار التاريخ والوقت

# appointmentTypeTitle
source: Appointment Type
ar: نوع الموعد

# selectTypeLabel
source: Select Type
ar: اختر النوع

# paymentStatusTitle
source: Payment Status
ar: حالة الدفع

# consultationType
source: Consultation
ar: استشارة

# followupType
source: Follow-up
ar: متابعة

# emergencyType
source: Emergency
ar: طوارئ

# procedureType
source: Procedure
ar: إجراء

# failedToSaveItemError
source: Failed to save item
ar: فشل حفظ العنصر

# failedToUseItemError
source: Failed to use item
ar: فشل استخدام العنصر

# failedToDeleteItemError
source: Failed to delete item
ar: فشل حذف العنصر

# useTooltip
source: Use
ar: استخدام

# periodToday
source: Today
ar: اليوم

# periodThisWeek
source: This Week
ar: هذا الأسبوع

# periodThisMonth
source: This Month
ar: هذا الشهر

# periodThisYear
source: This Year
ar: هذه السنة

# periodGlobal
source: Global
ar: الكل

# periodCustom
source: Custom
ar: مخصص

# periodCustomDate
source: Custom Date
ar: تاريخ مخصص

# incomeTitle
source: Income
ar: الدخل

# expensesTitle
source: Expenses
ar: المصاريف

# netProfitTitle
source: Net Profit
ar: صافي الربح

# taxLabel
source: Tax
ar: الضريبة

# monthlyBudgetTitle
source: Monthly Budget
ar: الميزانية الشهرية

# budgetExceededAlert
source: Budget exceeded!
ar: تم تجاوز الميزانية!

# recurringChargesTooltip
source: Recurring Charges
ar: الفواتير المتكررة

# financeSettingsTooltip
source: Finance Settings
ar: إعدادات المالية

# incomeType
source: Income
ar: دخل

# expenseType
source: Expense
ar: مصروف

# dateLabel
source: Date
ar: التاريخ

# categoryLabel
source: Category
ar: فئة

# deleteRecurringChargeTitle
source: Delete Recurring Charge
ar: حذف الفاتورة المتكررة

# deleteRecurringChargeContent
source: Are you sure you want to delete this recurring charge?
ar: هل أنت متأكد من حذف هذه الفاتورة المتكررة؟

# transactionAddedSuccess
source: Transaction added successfully
ar: تمت إضافة المعاملة بنجاح

# catRent
source: Rent
ar: إيجار

# catSalaries
source: Salaries
ar: رواتب

# catInventory
source: Inventory
ar: مخزون

# catEquipment
source: Equipment
ar: معدات

# catMarketing
source: Marketing
ar: تسويق

# catUtilities
source: Utilities
ar: خدمات

# catMaintenance
source: Maintenance
ar: صيانة

# catTaxes
source: Taxes
ar: ضرائب

# catOther
source: Other
ar: أخرى

# catProductSales
source: Product Sales
ar: مبيعات المنتجات

# freqDaily
source: Daily
ar: يومي

# freqWeekly
source: Weekly
ar: أسبوعي

# freqMonthly
source: Monthly
ar: شهري

# freqQuarterly
source: Quarterly
ar: ربع سنوي

# freqYearly
source: Yearly
ar: سنوي

# freqCustom
source: Custom
ar: مخصص

source: Error saving recurring charge
ar: خطأ في حفظ الفاتورة المتكررة

source: Edit Item
ar: تعديل العنصر

source: Cost per Unit
ar: التكلفة لكل وحدة

source: Total Cost
ar: التكلفة الإجمالية

source: Cost Type
ar: نوع التكلفة

# calculatedUnitCost
source: Calculated Unit Cost: {currency}{cost}
ar: تلكفة الوحدة المحسوبة: {currency}{cost}

# enterCost
source: Please enter cost
ar: الرجاء إدخال التكلفة

source: Expires (Days)
ar: تنتهي الصلاحية (أيام)

source: Low Stock Level
ar: مستوى المخزون المنخفض

# useItemTitle
source: Use {itemName}
ar: استخدام {itemName}

# currentStock
source: Current Stock: {quantity}
ar: المخزون الحالي: {quantity}

source: Quantity to Use
ar: الكمية المراد استخدامها

# unitsSuffix
source: units
ar: وحدات

# enterValidPositiveNumber
source: Please enter a valid positive number
ar: الرجاء إدخال رقم موجب صحيح

# cannotUseMoreThanStock
source: Cannot use more than current stock
ar: لا يمكن استخدام أكثر من المخزون الحالي

# remainingStock
source: Remaining Stock: {quantity}
ar: المخزون المتبقي: {quantity}

source: Confirm Use
ar: تأكيد الاستخدام

# filterAll
source: All
ar: الكل

# filterToday
source: Today
ar: اليوم

# filterThisWeek
source: This Week
ar: هذا الأسبوع

# filterThisMonth
source: This Month
ar: هذا الشهر

# filterEmergency
source: Emergency
ar: طوارئ

# patientIdHeader
source: ID
ar: المعرف

# dueHeader
source: Due
ar: مستحق

# totalCostLabel
source: Total Cost ($)
ar: التكلفة الإجمالية ($)

# amountPaidLabel
source: Amount Paid ($)
ar: المبلغ المدفوع ($)

# balanceDueLabel
source: Balance Due
ar: الرصيد المستحق

# visitHistoryTitle
source: Visit History
ar: سجل الزيارات

# lastVisitLabel
source: Last visit: {date}
ar: آخر زيارة: {date}

# selectPatientToViewHistory
source: Select a patient to view visit history
ar: اختر مريضاً لعرض سجل الزيارات

# addEditButton
source: Add/Edit
ar: إضافة/تعديل

# saveButton
source: Save
ar: حفظ

source: Profit Trend
ar: اتجاه الأرباح

source: Expense Breakdown
ar: توزيع النفقات

# noExpensesInPeriod
source: No expenses in this period
ar: لا توجد نفقات في هذه الفترة

source: No data to display
ar: لا توجد بيانات لعرضها

source: Cancelled
ar: ملغى

source: Unknown Patient
ar: مريض غير معروف

source: Loading...
ar: جار التحميل...

# errorLabel
source: Error
ar: خطأ

source: Delete
ar: حذف

source: Delete Transaction
ar: حذف المعاملة

source: Premium Account
ar: حساب مميز

# premiumDaysLeft
source: Premium: {days} days left
ar: مميز: {days} أيام متبقية

source: Premium Expired
ar: انتهى البريميوم

# trialVersionDaysLeft
source: Trial Version: {days} days left
ar: نسخة تجريبية: {days} أيام متبقية

source: Trial Expired
ar: انتهت الفترة التجريبية

source: Activate Premium
ar: تفعيل البريميوم

source: Finance Settings
ar: إعدادات المالية

source: Include Inventory Costs
ar: تضمين تكاليف المخزون

source: Include Appointments
ar: تضمين المواعيد

source: Include Recurring Charges
ar: تضمين الرسوم المتكررة

# compactNumbers
source: Compact Numbers (e.g. 1K)
ar: أرقام مدمجة (مثال: 1K)

# compactNumbersSubtitle
source: Use short format for large numbers
ar: استخدم تنسيقاً قصيراً للأرقام الكبيرة

source: Monthly Budget Cap
ar: الحد الأقصى للميزانية الشهرية

# taxRatePercentage
source: Tax Rate (%)
ar: معدل الضريبة (%)

source: Staff Management
ar: إدارة الموظفين

source: Add Assistant
ar: إضافة مساعد

source: Add Receptionist
ar: إضافة موظف استقبال

source: Current Staff
ar: الموظفون الحاليون

# noStaffAdded
source: No staff members added yet
ar: لم يتم إضافة موظفين بعد

source: Change PIN
ar: تغيير رمز PIN

source: Remove Staff
ar: إزالة الموظف

source: Update PIN
ar: تحديث رمز PIN

# newPin
source: New PIN (4 digits)
ar: رمز PIN جديد (4 أرقام)

source: Username
ar: اسم المستخدم

# enterUsername
source: Enter username for staff member
ar: أدخل اسم المستخدم للموظف

source: Add Staff
ar: إضافة موظف

# staffAddedSuccess
source: Staff member added successfully
ar: تم إضافة الموظف بنجاح

# staffRemovedSuccess
source: Staff member removed
ar: تم إزالة الموظف

# pinUpdatedSuccess
source: PIN updated successfully
ar: تم تحديث رمز PIN بنجاح

# deleteStaffTitle
source: Delete Staff Member
ar: حذف موظف

# deleteStaffConfirm
source: Are you sure you want to remove {username}?
ar: هل أنت متأكد أنك تريد إزالة {username}؟

# roleAssistant
source: Assistant
ar: مساعد

# roleReceptionist
source: Receptionist
ar: موظف استقبال

# roleDentist
source: Dentist
ar: طبيب أسنان

# roleDeveloper
source: Developer
ar: مطور

# overpaid
source: Overpaid: {amount}
ar: مدفوع بالزيادة: {amount}

# due
source: Due: {amount}
ar: مستحق: {amount}

source: Fully Paid
ar: مدفوع بالكامل

# appointmentPaymentDescription
source: Appointment payment for {type}
ar: دفع موعد لـ {type}

# proratedLabel
source: Pro-rated
ar: تناسبي

source: days
ar: أيام

source: Status
ar: الحالة

source: Delete Visit
ar: حذف الزيارة

source: Connection Settings
ar: إعدادات الاتصال

source: Network Connection
ar: اتصال الشبكة

# serverDeviceNotice
source: This device is the SERVER. Share the IP below with staff devices.
ar: هذا الجهاز هو الخادم. شارك عنوان IP أدناه مع أجهزة الموظفين.

# clientDeviceNotice
source: This device is a CLIENT. Enter the Server IP to connect.
ar: هذا الجهاز هو عميل. أدخل عنوان IP للخادم للاتصال.

source: Connection Status
ar: حالة الاتصال

source: Possible IP Addresses:
ar: عناوين IP الممكنة:

source: Manual Connection
ar: اتصال يدوي

source: Server IP Address
ar: عنوان IP للخادم

source: Connect to Server
ar: الاتصال بالخادم

source: Connecting...
ar: جاري الاتصال...

# connectedSync
source: Connected! Initializing sync...
ar: تم الاتصال! جاري بدء المزامنة...

source: Invalid IP or Port
ar: عنوان IP أو منفذ غير صالح

# firewallWarning
source: If connection fails, check your Windows Firewall to allow 'DentalTid' on Private/Public networks.
ar: إذا فشل الاتصال، فافحص جدار حماية Windows للسماح بـ 'DentalTid' على الشبكات الخاصة/العامة.

source: Ready to connect.
ar: جاهز للاتصال.

source: Server Running
ar: الخادم قيد التشغيل

source: Server Stopped
ar: تم إيقاف الخادم

source: Start Server
ar: بدء تشغيل الخادم

source: Stop Server
ar: إيقاف الخادم

source: Server Logs
ar: سجلات الخادم

# copyLogsSuccess
source: Logs copied to clipboard
ar: تم نسخ السجلات إلى الحافظة

source: Port
ar: المنفذ

# acceptTermsError
source: Please accept the terms and conditions
ar: يرجى قبول الشروط والأحكام

source: Dentist Login
ar: دخول طبيب الأسنان

source: Dentist Registration
ar: تسجيل طبيب الأسنان

source: Staff Portal
ar: بوابة الموظفين

source: Forgot Password?
ar: هل نسيت كلمة السر؟

# authError
source: An error occurred, please check your credentials.
ar: حدث خطأ، يرجى التحقق من بيانات الاعتماد الخاصة بك.

# weakPasswordError
source: The password provided is too weak.
ar: كلمة المرور المقدمة ضعيفة للغاية.

# emailInUseError
source: An account already exists for that email.
ar: يوجد حساب بالفعل لهذا البريد الإلكتروني.

# userNotFoundError
source: No user found for that email.
ar: لم يتم العثور على مستخدم لهذا البريد الإلكتروني.

# wrongPasswordError
source: Wrong password provided for that user.
ar: كلمة مرور خاطئة لهذا المستخدم.

# networkError
source: Network error. check your connection.
ar: خطأ في الشبكة. تحقق من اتصالك.

# authFailed
source: Authentication failed: {error}
ar: فشل المصادقة: {error}

# invalidStaffCredentials
source: Invalid Username or PIN
ar: اسم المستخدم أو رمز PIN غير صحيح

# enterEmailFirst
source: Please enter your email address first
ar: يرجى إدخال عنوان بريدك الإلكتروني أولاً

# passwordResetSent
source: Password reset email sent! Check your inbox.
ar: تم إرسال بريد إلكتروني لإعادة تعيين كلمة المرور! تحقق من بريدك الوارد.

# contactDeveloperLabel
source: Contact Developer
ar: اتصل بالمطور

source: Contact Us
ar: اتصل بنا

source: Dentist
ar: طبيب أسنان

source: Staff
ar: موظف

source: Email Address
ar: البريد الإلكتروني

source: Password
ar: كلمة المرور

source: Your Name
ar: اسمك

# clinicNameLabel
source: Clinic Name
ar: اسم العيادة

source: License Number
ar: رقم الترخيص

# acceptTermsAndConditions
source: I accept the Terms and Conditions
ar: أوافق على الشروط والأحكام

source: PIN (4 Digits)
ar: رمز PIN (4 أرقام)

source: SIGN IN
ar: تسجيل الدخول

source: REGISTER
ar: تسجيل

# loginLabel
source: LOGIN
ar: دخول

# rememberLabel
source: Remember
ar: تذكرني

# dontHaveAccount
source: Don't have an account?
ar: ليس لديك حساب؟

# alreadyHaveAccount
source: Already have an account?
ar: لديك حساب بالفعل؟

# signUpSmall
source: Sign up
ar: سجل الآن

# signInSmall
source: Sign in
ar: سجل الدخول

source: Good Morning
ar: صباح الخير

source: Good Afternoon
ar: مساء الخير
